docs/test-results/phase2/secondary/vt-unlimited-screening/a2-vt-limited-20/k6.log
time="2026-08-20T23:43:59+09:00" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"maxDuration\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/user/Documents/GitHub/llm-concurrency-lab/load-test-k6/scenarios/01-concurrent-connections.js
        output: -

     scenarios: (100.00%) 1 scenario, 60 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 60 iterations shared among 60 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 20/60 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  00m01.0s/10m0s  40/60 shared iters

running (00m02.0s), 20/60 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  00m02.0s/10m0s  40/60 shared iters

running (00m03.0s), 20/60 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  00m03.0s/10m0s  40/60 shared iters

running (00m04.0s), 20/60 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  00m04.0s/10m0s  40/60 shared iters

running (00m05.0s), 20/60 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  00m05.0s/10m0s  40/60 shared iters

running (00m06.0s), 20/60 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  00m06.0s/10m0s  40/60 shared iters

running (00m07.0s), 20/60 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 60 VUs  00m07.0s/10m0s  40/60 shared iters


  █ TOTAL RESULTS 

    CUSTOM
    client_events_received_total.....: 720    91.225801/s
    client_stream_completed_total....: 20     2.53405/s
    client_stream_duration_seconds...: avg=2.6391 min=0.012   med=0.013   max=7.893 p(90)=7.892 p(95)=7.892  
    client_stream_failed_total.......: 40     5.0681/s
    client_ttfc_seconds..............: avg=1.0261 min=1.025   med=1.0255  max=1.03  p(90)=1.029 p(95)=1.02905
    sse_event........................: 720    91.225801/s

    HTTP
    http_req_duration................: avg=2.63s  min=11.49ms med=13.36ms max=7.89s p(90)=7.89s p(95)=7.89s  
    http_reqs........................: 60     7.60215/s

    EXECUTION
    iteration_duration...............: avg=2.63s  min=12.04ms med=13.4ms  max=7.89s p(90)=7.89s p(95)=7.89s  
    iterations.......................: 60     7.60215/s
    vus..............................: 20     min=20      max=20
    vus_max..........................: 60     min=60      max=60

    NETWORK
    data_received....................: 100 kB 13 kB/s
    data_sent........................: 16 kB  2.0 kB/s



running (00m07.9s), 00/60 VUs, 60 complete and 0 interrupted iterations
default ✓ [ 100% ] 60 VUs  00m07.9s/10m0s  60/60 shared iters